// KISS
// let a = 1;
// let b = 2;
// let c = a + b;

// console.log(c)

function sum(a, b) {
    console.log(a + b);
    return a + b;
}

let result = sum(1, 2)
result = sum(result, 3)
console.log('Final result: ', result)

// Boy Scout Rule : Эх код дотор өөрчлөлт оруулах үед өмнө байснаас нь илүү цэвэрхэн болгож засах хэрэгтэй
// KISS DRY YAGNI

// Дүгнээд хэлэхэд код бичихдээ зүгээр нэг ажилладаг биш, өөрөө сайн ойлгож системээ бүхлээр нь харан бичих хэрэгтэй бөгөөд бичсэн код нь
// Уншигдах байдал (Readability) — хэн ч хараад ойлгох
// Өргөтгөх боломж (Extensibility) — өөрчлөлт оруулах боломж
// Засварлах боломж (Maintainability) — авч явахад хялбар
// Модультой байх чанар (Modularity) — хэсэгчлэн дахин ашиглах
// шинжүүдийг агуулсан байвал сайн код болсныг илтгэх байх гэж би бодож байна.
